Repository: donadigo/eddy
Catalog: po/extra/*.po
Languages: pt

source: Install and Manage .deb Files
pt: Instalar e gerir ficheiros .deb

source: Install, uninstall and view information about debian packages.
pt: Instalar, desinstalar e ver informação sobre pacotes debian.

source: Features include:
pt: Funcionalidades incluídas:

source: Install multiple packages at once
pt: Instala vários pacotes ao mesmo tempo

source: Upgrade and downgrade existing packages
pt: Atualiza e desatualiza de pacotes existentes

source: Load all packages automatically from your Downloads folder
pt: Carrega todos os pacotes automaticamente a partir da sua pasta de Transferências

source: Complete system integration including notifications and progress bar in the dock
pt: Integração com o sistema incluindo notificações e barra de progresso na doca

source: This release fixes comparing some package versions and includes new translations:
pt: Esta versão corrige a comparação de algumas versões de pacotes e inclui novas traduções:

source: Dutch translation (Stan Janssen)
pt: Tradução holandesa (Stan Janssen)

source: Czech translation (Jan Marek)
pt: Tradução checa (Jan Marek)

source: French translation (Nathan Bonnemains)
pt: Tradução francesa (Nathan Bonnemains)

source: Japanese translation (Ryo Nakano)
pt: Tradução japonesa (Ryo Nakano)

source: Danish translation (siigdev)
pt: Tradução dinamarquesa (siigdev)

source: Portuguese translation (Hugo Carvalho)
pt: Tradução portuguesa (Hugo Carvalho)

source: Spanish translation (Antonio Luis Román, Cristian Molina)
pt: Tradução espanhola (Antonio Luis Román, Cristian Molina)

source: Fixed:
pt: Correções:

source: Some newer packages wrongly showed a button to downgrade
pt: Alguns pacotes mais recentes mostraram erradamente um botão para desatualizar

source: This release fixes a critical error where the app would not launch due to missing files in installation.
pt: Esta versão corrige um erro crítico em que a aplicação não seria iniciada devido à falta de ficheiros na instalação.

source: This release makes a Eddy work on Juno and includes new translations:
pt: Esta versão faz o Eddy funcionar na versão Juno e inclui novas traduções:

source: Russian translation (camellan)
pt: Tradução russa (camellan)

source: Special thanks to eudaldgr for porting Eddy to the Meson build system.
pt: Um agradecimento especial ao eudaldgr por ter portado o Eddy para o sistema de compilação Meson.

source: This release fixes small annoyances with the UI and includes new translations:
pt: Esta versão corrige pequenos constrangimentos com a IU e inclui novas traduções:

source: Brazilian Portuguese translation (Paulo Galardi)
pt: Tradução do Português do Brasil (Paulo Galardi)

source: Lithuanian translation (welaq)
pt: Tradução lituana (welaq)

source: Spanish translation (Juan Carlos)
pt: Tradução espanhola (Juan Carlos)

source: French translation (nvivant)
pt: Tradução francesa (nvivant)

source: Fast switching to the detailed view while loading packages caused unintentional auto-switching to list view
pt: Mudança rápida para a vista detalhada durante o carregamento de pacotes causou a comutação automática não intencional para a vista de lista

source: Error dialog now has a proper title
pt: A caixa de diálogo de erro agora tem um título adequado

source: This release adds small improvements to the user interface and adds initial support for translations.
pt: Esta versão adiciona pequenas melhorias à interface do utilizador e adiciona suporte inicial para traduções.

source: Miscellaneous:
pt: Diversos:

source: Show operation percentage alongside the status label
pt: Mostrar a percentagem de operação ao lado da descrição do estado

source: Properly handle terminating the application by external processes
pt: Tratar adequadamente o terminar da aplicação por processos externos

source: Fix punctuation in the quit dialog
pt: Corrige a pontuação na caixa de diálogo de saída

source: Replace confusing quit dialog actions with more explicit ones
pt: Substitui as ações confusas da caixa de diálogo de saída por outras mais explícitas

source: Update application metadata
pt: Atualizar os metadados da aplicação

source: Update Dutch and German translations
pt: Atualização de traduções em holandês e alemão

source: "About Eddy" now opens this AppCenter page
pt: "Sobre o Eddy" abre agora esta página da Loja de Aplicações

source: Fix about dialog not showing correctly
pt: Correção sobre a caixa de diálogo não ser apresentada corretamente

source: Fix the description label being already selected when entering details view
pt: Corrige a etiqueta de descrição já selecionada ao introduzir a vista de detalhes

source: Minor code cleanups
pt: Pequenas limpezas de código

source: New design of the details view
pt: Nova aparência da visualização de detalhes

source: Better visibility in the window's titlebar
pt: Melhor visibilidade na barra de título da janela

source: Fix choosing "Load from Downloads" option only showing a spinner if there are no packages in the folder
pt: Corrige a opção de escolha "Carregar das Transferências" de apenas mostrar um botão giratório se não houver pacotes na pasta

source: More debug information in the app output if ran in a shell
pt: Mais informação de depuração na saída da aplicação se executada numa shell

source: Rename executable to match RDNN naming convention
pt: Renomear o executável para corresponder à convenção de nomeação RDNN

source: Add a button to update / downgrade already installed package
pt: Adiciona um botão para atualizar / desatualizar o pacote já instalado

source: Fix window growing in size when summary or package name is really long
pt: Corrige o aumento do tamanho da janela quando o resumo ou nome do pacote é muito comprido

source: The application can be now found under "System" category
pt: A aplicação pode agora ser encontrada na categoria "Sistema"

source: Ctrl-Q now exists the app
pt: Ctrl-Q agora faz sair da aplicação

source: Do not display error dialog when operation cancelled
pt: Não mostra a caixa de diálogo de erro quando a operação é cancelada

source: Display the progress of current operation in the dock
pt: Mostrar o progresso da operação atual na Doca

source: Sort packages by their state and name in the list view
pt: Ordena os pacotes por estado e nome na visualização de lista

source: Save window state between sessions
pt: Guardar o estado da janela entre as sessões

source: Improved performance of launching the app second time
pt: Melhor desempenho ao iniciar a aplicação pela segunda vez

source: Support other package formats such as .rpm for other package managers
pt: Suporta outros formatos de pacote como .rpm para outros gestores de pacotes

source: Minor fixes
pt: Pequenas correções

source: Added an ability to open packages with Eddy in the file manager
pt: Adicionada a capacidade de abrir pacotes com o Eddy no gestor de ficheiros

source: Show a spinner when loading packages
pt: Mostra um botão giratório ao carregar pacotes

source: Fixed adding a file already in the list duplicated it
pt: Corrige o adicionar de um ficheiro já na lista de o duplicar

source: Completely port to PackageKit and remove aptdaemon dependency
pt: Mudança completa para o PackageKit e remove a dependência do aptdaemon

source: Fix wrong icon displayed in the notifications
pt: Corrige ícone incorreto apresentado nas notificações

source: Fix Desktop file being invalid
pt: Corrige o ficheiro do ambiente de trabalho de ser inválido

source: Bump granite dependency version
pt: Atualização da versão de dependências do granite

source: Update debian packaging
pt: Atualiza a empacotagem debian

source: Initial release
pt: Versão inicial

source: Package Installer
pt: Instalador de Pacotes

source: Install Debian packages
pt: Instala pacotes Debian

source: About Eddy
pt: Sobre o Eddy
